# common/constants.py

# Конфігурація для кнопок рівня доступу (для використання в адмін-панелі)
ACCESS_LEVEL_BUTTONS = [
    (0, "🔒 Гість [Level 0]"),
    (1, "🧭 Техно-Навігатор [L1]"),
    (3, "🔧 Системний Інженер [L3]"),
    (6, "📊 Керівник Протоколів [L6]"),
    (10, "🛡️ Адміністратор Ядра [L10]"),
    (100, "🧬 Архітектор Системи [ROOT]"),
    (101, "🌀 Пробуджений Refridex [L∞]")  # Таємний рівень
]

# Конфігурація всіх кнопок головного меню за їх мінімальним рівнем доступу
# (Це замінить BUTTONS_CONFIG у keyboards/reply_keyboard.py)
ALL_MENU_BUTTONS = [
    ("📚 Каталог", 0),
    ("📖 Довідники", 0),
    ("🕵️ Пошук", 0),
    ("⚠️ Коди помилок", 0),
    ("🛠️ Інструкції", 0),
    ("📐 Додаткові функції", 0),
    ("🅰️ Пошук магазинів", 1),
    ("🔄 Отримати список ТТ", 1),
    ("📝 Завдання в роботі", 1),
    ("🧾 Звіт по роботі", 1),
    ("Пробіг", 1), # <--- ДОДАНО НОВУ КНОПКУ
    ("⚙️ Адміністрування", 10),
    ("📝 Додати або редагувати дані", 10),  # <--- ОНОВЛЕНО НАЗВУ КНОПКИ
    # Додайте інші кнопки тут
]

BUTTONS_PER_PAGE = 6 # Максимум 3 ряди по 2 кнопки, якщо кнопок більше чим 6 то розділяти клавіатуру на сторінки
USERS_PER_PAGE = 5 # Або будь-яке інше бажане значення для кількості користувачів на сторінці